/*C++ не має вбудованої системи збору сміття, як отримується в інших мовах програмування, 
наприклад, у C# чи Java. У C++, програміст відповідає за керуванням життєвим циклом об'єктів і відповідно
за відповідне їх вивільнення після використання.
Є кілька бібліотек, які можна використовувати
для автоматичного вивільнення пам'яті, такі як Boehm GC та TBB malloc. 
Однак, їх використання не рекомендується для всіх проектів, оскільки вони можуть призвести 
до непередбачуваних результатів у великих та складних програмах.
Отже, у C++ робота з пам'яттю вимагає від програміста вручну керувати
життєвим циклом об'єктів та звільненням невикористаної пам'яті.*/

#include <gc.h>
#include <iostream>

int main() {
    GC_INIT();
    int* p = (int*)GC_MALLOC(sizeof(int));
    *p = 42;
    std::cout << *p << std::endl;
    GC_FREE(p);
    return 0;
}
